app/Http/Traits/ActiveRoundTrait.php

select * from `rounds` where `rounds`.`deleted_at` is null limit 1
---
  public function roundsIsset()
  {
    if (Round::first()) return true;

select * from `rounds` where `end_wishes_date` > '2022-07-13 07:42:17' and `rounds`.`deleted_at` is null order by `end_wishes_date` asc limit 1
---
  public function activeRound()
  {
    return Round::query()
      ->where('end_wishes_date', '>', Carbon::now())
      ->orderBy('end_wishes_date')
      ->first();