app/Http/Livewire/PropertiesTable.php

    public function render()
    {
        $properties = Property::query()
            ->where('name', 'like', '%' . $this->search . '%')
            ->orWhere('country', 'like', '%' . $this->search . '%')
            ->orWhere('address', 'like', '%' . $this->search . '%')
            ->get();
---
select * from `properties` where (`name` like '%%' or `country` like '%%' or `address` like '%%') and `properties`.`deleted_at` is null