app/Http/Livewire/StockholdersTable.php

    public function render(User $stockholders, Request $request)
    {
        $roundId = ($request->round_id) ? $request->round_id : $this->activeRound()->id;
        $stockholders = $stockholders->searchStockholdersWithPriorityAndRound($roundId, $this->search);
---
select * from `rounds` where `rounds`.`deleted_at` is null