app/Http/Controllers/Admin/DashboardController.php

select * from `rounds` where `rounds`.`deleted_at` is null
select * from `weeks` where `round_id` = 2 and `weeks`.`deleted_at` is null
select count(*) as aggregate from `weeks` where `round_id` = 2 and `weeks`.`deleted_at` is null
select * from `priorities` where `round_id` = 2 limit 15 offset 30
select count(*) as aggregate from `priorities` where `round_id` = 2
---
    public function index(Request $request, User $stockholders, Round $round, Wish $wishes, Week $week)
    {
        $rounds = Round::all();
        $roundId = ($request->round_id) ? $request->round_id : $this->activeRound()->id;
        $round = $rounds->where('id', $roundId)->first();
        $weeks = Week::whereRoundId($roundId)->get();
        $weeksCount = Week::whereRoundId($roundId)->count();
        $priorities = Priority::whereRoundId($roundId)->paginate();