app/Http/Controllers/Admin/PropertyController.php

select * from `properties` where `properties`.`deleted_at` is null
---
    public function index(Round $round): Application|Factory|View
    {
        $round = $round->currentRoundId();
        $properties = Property::all()->sortBy('country');