app/Http/Controllers/Admin/StockholderController.php

    public function store(StoreStockholderRequest $request, Priority $priority): RedirectResponse
    {
        $stockholder = User::create([
            'name' => $request['name'],
            'email' => $request['email'],
            'password' => Hash::make($request['password']),
        ]);

        $minPriority = $priority->where('round_id', $request->round)->max('priority');
---
select max(`priority`) as aggregate from `priorities` where `round_id` = 2